# GetAllInsulationSpecifications Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllInsulationSpecifications Method
FabricationConfiguration Class See Also
---
Gets all insulation specification identifiers in the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<int> GetAllInsulationSpecifications(
	FabricationPart pFabPart
)
```

Visual Basic
---
```text
Public Function GetAllInsulationSpecifications ( _
	pFabPart As FabricationPart _
) As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetAllInsulationSpecifications(
	FabricationPart^ pFabPart
)
```

# ### Parameters
pFabPart
    Type: Autodesk.Revit.DB..::..FabricationPart The fabrication part.
# ### Return Value
An array of insulation specification identifiers.
# Remarks
If a part is passed, only returns insulation specification which are valid for the part, otherwise returns all insulation specifications.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace